Autodesk.Navisworks.Api.FileReferenceType
Specifies type of FileReference

Autodesk.Navisworks.Api.FileReferenceType.None
Null or empty file reference

Autodesk.Navisworks.Api.FileReferenceType.Local
Absolute path to file on disk

Autodesk.Navisworks.Api.FileReferenceType.Remote
URL for remote file

Autodesk.Navisworks.Api.FileReferenceType.Embedded
File embedded in referring file

Autodesk.Navisworks.Api.FileReferenceType.Relative
Path relative to referring file

Autodesk.Navisworks.Api.FileReferenceType.Unknown
Unknown type of file reference